tests/powderBed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    ymax
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4800;
        startFace       565600;
    }
    xmin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       570400;
    }
    xmax
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       573600;
    }
    ymin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4800;
        startFace       576800;
    }
    zmin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2400;
        startFace       581600;
    }
    zmax
    {
        type            patch;
        nFaces          2400;
        startFace       584000;
    }
)

// ************************************************************************* //
