tests/powderBed/constant/physicalProperties.metal
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   208.0; // ?
    }

    equationOfState
    {
        rho         8000.0; // beta = 5e-6
    }

    thermodynamics
    {
        Cp          520;
        hf          0; // L = 2.7e5
    }

    transport
    {
        mu          0.004; // nu = 5e-7
        kappa       10.0;
    }
}


// ************************************************************************* //
